"""
2.6
*Реализовать структуру данных «Товары».
 Она должна представлять собой список кортежей.
 Каждый кортеж хранит информацию об отдельном товаре.
 В кортеже должно быть два элемента — номер товара и словарь
 с параметрами (характеристиками товара: название, цена, количество, единица измерения).
 Структуру нужно сформировать программно, т.е. запрашивать все данные у пользователя.
 Пример готовой структуры:
 [
     (1, {“название”: “компьютер”, “цена”: 20000, “количество”: 5, “eд”: “шт.”}),
     (2, {“название”: “принтер”, “цена”: 6000, “количество”: 2, “eд”: “шт.”}),
     (3, {“название”: “сканер”, “цена”: 2000, “количество”: 7, “eд”: “шт.”})
 ]
 Необходимо собрать аналитику о товарах. Реализовать словарь,
 в котором каждый ключ — характеристика товара, например название,
 а значение — список значений-характеристик, например список названий товаров.
 Пример:
 {
 “название”: [“компьютер”, “принтер”, “сканер”],
 “цена”: [20000, 6000, 2000],
 “количество”: [5, 2, 7],
 “ед”: [“шт.”]
 }
"""
from typing import List

list_articles = []
id_list = 1

print("\n" * 100)
print("\n                          Структура данных «Товары»")
while True:


    print("___________________________________________________________________________")
    add = input("\"+\" - add article | \"*\" - analytics | \"&\" - print articles | any key - exit:  ")
    if add == "+":
        while True:
            print("\n" * 100)
            print("\n                Режим добавления товара")
            print("___________________________________________________________________________")
            article = {}
            article["Наименование товара"] = input("Наименование товара: ")
            article["Стоимость товара"] = input("Стоимость товара: ")
            article ["Количество товара"] = input("Количество товара: ")
            article ["Единицы измерения"] = input("Единицы измерения: ")
            print("___________________________________________________________________________")
            out_article = input("\"е\" - edit | any keу - save: ")
            if out_article == "e":
                continue
            else:
                print("\n" * 100)
                print("Товар добавлен!\n")
                list_articles.append((id_list,article))
                id_list += 1
                break

    elif add == "&":
        print("\n" * 100)
        print("\n                Список товаров")
        print("___________________________________________________________________________")
        if len(list_articles) == 0:
            print("\nДанные в базе отсутсвуют. Добавьте данные")
        else:
            for i in list_articles:
                print(i)

    elif add == "*":
        print("\n" * 100)
        print("\n                Режим статистики")
        print("___________________________________________________________________________")
        analytics = {}
        for i1 in article:
            stat = []
            for i2 in list_articles:
                stat.append(i2[1][i1])
            analytics[i1] = stat
        for x in analytics:
            print(f"{x} - {analytics.get(x)}")

    else:
        print("\n_________________________________ exit _______________________________\n")
        break
